In [1]:
import pandas as pd
import numpy as np

In [4]:
dict1={'Names':['Ramesh', 'Suresh', np.nan, 'Mahesh'],
       'Age':[31,32,33, np.nan],
       'City':[np.nan, 'Hyd', 'Mumbai', 'Chennai']}

In [6]:
data1=pd.DataFrame(dict1)

In [7]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [8]:
data1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [9]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [10]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [23]:
dict2={'Names':['Ramesh', 'Suresh',None, 'Mahesh'],
       'Age':[31,32,33,None],
       'City':[None, 'Hyd', 'Mumbai', 'Chennai']}

In [24]:
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [25]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [26]:
data2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [27]:
dict3={'Names':['Ramesh', 'Suresh', 'Null', 'Mahesh'],
       'Age':[31,32,33, 'Null'],
       'City':['Null', 'Hyd', 'Mumbai', 'Chennai']}
dict3

{'Names': ['Ramesh', 'Suresh', 'Null', 'Mahesh'],
 'Age': [31, 32, 33, 'Null'],
 'City': ['Null', 'Hyd', 'Mumbai', 'Chennai']}

In [28]:
data3=pd.DataFrame(dict3)
data3

    Names   Age     City
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  Chennai

In [29]:
data3.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [30]:
data3.isnull().sum()

Names    0
Age      0
City     0
dtype: int64

**Method-1**
>Fill missing values with random number

In [33]:
dict1={'Names':['Ramesh', 'Suresh', np.nan, 'Mahesh'],
       'Age':[31,32,33, np.nan],
       'City':[np.nan, 'Hyd', 'Mumbai', 'Chennai']}
data1=pd.DataFrame(dict1)
data1.fillna(40, inplace=True)
data1

    Names   Age     City
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

**Method-2**
>Fill the missing values in the specific column with random number

In [36]:
dict1={'Names':['Ramesh', 'Suresh', np.nan, 'Mahesh'],
       'Age':[31,32,33, np.nan],
       'City':[np.nan, 'Hyd', 'Mumbai', 'Chennai']}
data1=pd.DataFrame(dict1)
data1['Names'].fillna('Satish', inplace=True)
data1['Age'].fillna(99, inplace=True)
data1['City'].fillna('Hyd', inplace=True)
data1

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Satish  33.0   Mumbai
3  Mahesh  99.0  Chennai

**Method-3**

- bfill

- ffill

- pad

- backfill

In [40]:
dict1={'Names':['Ramesh', 'Suresh', np.nan, 'Mahesh'],
       'Age':[31,32,33, np.nan],
       'City':[np.nan, 'Hyd', 'Mumbai', 'Chennai']}
data1=pd.DataFrame(dict1)
data1.fillna(method='backfill', inplace=True)
data1
# Names - Index 2 value is missing , it will be replaced with index 3 value
# Age - Index 3 value is missing , it will be replaced with index 4 value i.e. NaN
# City - Index 0 value is missing , it will be replaced with index 1 value

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [41]:
dict1={'Names':['Ramesh', 'Suresh', np.nan, 'Mahesh'],
       'Age':[31,32,33, np.nan],
       'City':[np.nan, 'Hyd', 'Mumbai', 'Chennai']}
data1=pd.DataFrame(dict1)
data1.fillna(method='bfill', inplace=True)
data1
# bfill is same as backfill

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [43]:
dict1={'Names':['Ramesh', 'Suresh', np.nan, 'Mahesh'],
       'Age':[31,32,33, np.nan],
       'City':[np.nan, 'Hyd', 'Mumbai', 'Chennai']}
data1=pd.DataFrame(dict1)
data1.fillna(method='pad', inplace=True)
data1
# Names - Index 2 value is missing , it will be replaced with index 1 value
# Age - Index 3 value is missing , it will be replaced with index 2 value i.e. NaN
# City - Index 0 value is missing , it will be replaced with index -1 value i.e NaN

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [42]:
dict1={'Names':['Ramesh', 'Suresh', np.nan, 'Mahesh'],
       'Age':[31,32,33, np.nan],
       'City':[np.nan, 'Hyd', 'Mumbai', 'Chennai']}
data1=pd.DataFrame(dict1)
data1.fillna(method='ffill', inplace=True)
data1
# Names - Index 2 value is missing , it will be replaced with index 1 value
# Age - Index 3 value is missing , it will be replaced with index 2 value i.e. NaN
# City - Index 0 value is missing , it will be replaced with index -1 value i.e NaN

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

- bfill and backfill is same

- ffill and pad is same

**Methos-4**

- Mean

- Median

- Mode

In [47]:
dict1={'Names':['Ramesh', 'Suresh', np.nan, 'Mahesh'],
       'Age':[31,32,33, np.nan],
       'City':[np.nan, 'Hyd', 'Mumbai', 'Chennai']}
data1=pd.DataFrame(dict1)
age_mean=data1['Age'].mean()
#age_mean
data1['Age']=data1['Age'].fillna(age_mean)
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh  32.0  Chennai

In [48]:
dict1={'Names':['Ramesh', 'Suresh', np.nan, 'Mahesh'],
       'Age':[31,32,33, np.nan],
       'City':[np.nan, 'Hyd', 'Mumbai', 'Chennai']}
data1=pd.DataFrame(dict1)
age_median=data1['Age'].median()
#age_median
data1['Age']=data1['Age'].fillna(age_median)
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh  32.0  Chennai

**Method-5: KNN inputer**

**KNN**: K nearest neighbour
    
in the KNN inputer 
- instead of taking mean of all the values 
- will choose the neighouring data values
- will take mean of those values only

# formula to find out distance between 2 points - Squrt of (x2-x1)^2 + (y2-y1)^2 ===> pythagorous theorem
<img src="//upload.wikimedia.org/wikipedia/commons/thumb/5/55/Euclidean_distance_2d.svg/300px-Euclidean_distance_2d.svg.png" decoding="async" width="300" height="207" class="mw-file-element" srcset="//upload.wikimedia.org/wikipedia/commons/thumb/5/55/Euclidean_distance_2d.svg/450px-Euclidean_distance_2d.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/5/55/Euclidean_distance_2d.svg/600px-Euclidean_distance_2d.svg.png 2x" data-file-width="360" data-file-height="248">

In [64]:
# read the package
from sklearn.impute import KNNImputer

# save the package
knn=KNNImputer(n_neighbors=3)
# n_neighbors to be given by user. if not given by default it is 5

dict1={'Names':['Ramesh', 'Suresh', np.nan, 'Mahesh'],
       'Age':[20,60,55, np.nan],
       'City':[np.nan, 'Hyd', 'Mumbai', 'Chennai']}
data1=pd.DataFrame(dict1)
data1['Age']=knn.fit_transform(data1[['Age']])
data1

    Names   Age     City
0  Ramesh  20.0      NaN
1  Suresh  60.0      Hyd
2     NaN  55.0   Mumbai
3  Mahesh  45.0  Chennai

**Method 6: Based on other columns**
    
- Sometime all above methods does not provide good justification
- in that case we need to check other column dependency as wll
- Most of the time we pick the the column with higest corelation